In [20]:
import pandas as pd

In [21]:
def read_excel(file_name):
    df = pd.read_excel(file_name)
    print(df)
    return df

In [23]:
read_excel("data.xlsx")

       name  age        city
0     steve   25     chennai
1    sanjay   26     madurai
2     jerin   27  coimbatore
3  saravana   28       salem

       name  age        city
0     steve   25     chennai
1    sanjay   26     madurai
2     jerin   27  coimbatore
3  saravana   28       salem